# Creation of DataFrame

In [1]:
#importing pandas as pd
import pandas as pd

In [2]:
#Creating an empty data frame
df_empty = pd.DataFrame()
print(df_empty)

Empty DataFrame
Columns: []
Index: []

In [4]:
#creating list
list1 = ['a','b','c']
print(list1)

['a', 'b', 'c']

In [6]:
#creating a data frame from list
df1 = pd.DataFrame(list1)
print(df1)
#numbers are the index of the data frame

   0
0  a
1  b
2  c

In [7]:
#better visualization of dataframe other than print
df1 #this ouput is easy to visualize so this method is mostly used rather than print function

   0
0  a
1  b
2  c

In [8]:
#more than one data frame can be achived by list of list method
list2 = [[1,2,3],[3,4,5],[5,6,7]]
print(list2)

[[1, 2, 3], [3, 4, 5], [5, 6, 7]]

In [10]:
df2 = pd.DataFrame(list2)
df2

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7

In [11]:
#dictionary created
dict1 = {'id':[123,2345,56]}
dict1

{'id': [123, 2345, 56]}

In [13]:
#Creating data frame from dictionary
df3 = pd.DataFrame(dict1)
df3

     id
0   123
1  2345
2    56

In [14]:
#dictionary of list
dict2 = {'id':[123,2345,56], 'work':['admin','manager','analyst']}
dict2

{'id': [123, 2345, 56], 'work': ['admin', 'manager', 'analyst']}

In [15]:
#Creating data frame from dictionary
df4 = pd.DataFrame(dict2)
df4

     id     work
0   123    admin
1  2345  manager
2    56  analyst

In [21]:
#creating DataFrame from list of dictionary
ls_dict =[{'a':1, 'b':2, 'c':3}, {'a':4, 'b':5, 'c':6}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b  c
0  1  2  3
1  4  5  6

In [19]:
##creating DataFrame from list of unequal dictionary
ls_dict =[{'a':1, 'b':2, 'c':3}, {'a':4, 'b':5}]
df6 = pd.DataFrame(ls_dict)
df6

   a  b    c
0  1  2  3.0
1  4  5  NaN

In [20]:
#creating DataFrame from list of dictionary
ls_dict =[{'a':1, 'b':2, 'c':3}, {'a':4, 'b':5, 'd':6}]
df7 = pd.DataFrame(ls_dict)
df7

   a  b    c    d
0  1  2  3.0  NaN
1  4  5  NaN  6.0

In [23]:
#DataFrame from dictonary of series
dict_sr = {'id': pd.Series([1,2,3]), 'work':pd.Series(['admin','manager','analyst'])}
df8 = pd.DataFrame(dict_sr)
df8

   id     work
0   1    admin
1   2  manager
2   3  analyst

In [26]:
#creating DataFrame from list of tuples
ls_tuple =[('a','s','d'), (3,6,9)]
df9 = pd.DataFrame(ls_tuple)
df9

   0  1  2
0  a  s  d
1  3  6  9